// =========================================================
// Item.h 爆発アニメーション制御
// 
// 制作者:		日付：
// =========================================================
#ifndef _ITEM_H_
#define _ITEM_H_

// =========================================================
// マクロ定義
// =========================================================
#define MAX_ITEM (100)		// 総数

// =========================================================
// 構造体宣言
// =========================================================
struct ITEM {
	Float2 pos;		// 座標
	Float2 vel;		// 移動値
	Float2 size;	// サイズ
	int		no;		// パターン番号
	bool use;		// 使用フラグ
	bool erased;    // 取得状態
};

// =========================================================
// プロトタイプ宣言
// =========================================================
void InitializeItem(void);
void UpdateItem(void);
void DrawItem(void);
void FinalizeItem(void);
ITEM* GetItem(void);
void SetItem(Float2 p, Float2 s, int no);

#endif